#Η συμπλήρωση αφορά την αρχική ημερομηνία.
#Συμπλήρωση κι ανάθεση τιμών στις μεταβλητές για (ημέρα, μήνα και έτος).
dayA = 15
monthA = 3
yearA = 2018


#Συμπλήρωση μεταβλητών που αφορά την τελική ημερομηνία υπολογισμού.
dayB = 20
monthB = 8
yearB = 2022


#Έναρξη υπολογισμού για την διαφορά μεταξύ των ετών.
years = yearB - yearA

#Υπολογισμός των ημερών που έχουν περάσει για την κάθε ημερομηνία από την αρχή του αντίστοιχου έτους.
total_daysA = dayA + (monthA - 1) * 30
total_daysB = dayB + (monthB - 1) * 30

#Υπολογισμός συνολικών ημερών.
total_days = (total_daysB + 365 * years) - total_daysA

#Εμφάνιση υπολογισμού ημερών στον χρήστη.
print("The difference between the two dates in days: ", total_days)
